Youssef-Beltagy/Smart-Inhaler/BLE_p2pServer/STM32CubeIDE/Application/User/Core/app_entry.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file    app_entry.c
 * @author  MCD Application Team
 * @brief   Entry point of the Application
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
 * All rights reserved.</center></h2>
 *
 * This software component is licensed by ST under Ultimate Liberty license
 * SLA0044, the "License"; You may not use this file except in compliance with
 * the License. You may obtain a copy of the License at:
 *                             www.st.com/SLA0044
 *
 ******************************************************************************
 */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "app_common.h"
#include "main.h"
#include "app_entry.h"
#include "app_ble.h"
#include "ble.h"
#include "tl.h"
#include "stm32_seq.h"
#include "shci_tl.h"
#include "stm32_lpm.h"
#include "app_debug.h"

/* Private includes -----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
extern RTC_HandleTypeDef hrtc;
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private defines -----------------------------------------------------------*/
#define POOL_SIZE (CFG_TLBLE_EVT_QUEUE_LENGTH*4U*DIVC(( sizeof(TL_PacketHeader_t) + TL_BLE_EVENT_FRAME_SIZE ), 4U))

/* USER CODE BEGIN PD */
#define LED_ON_PVD                 (5*1000*1000/CFG_TS_TICK_VAL) /**< 5s */
/* USER CODE END PD */

/* Private macros ------------------------------------------------------------*/
/* USER CODE BEGIN PM */
/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t EvtPool[POOL_SIZE];
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static TL_CmdPacket_t SystemCmdBuffer;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t SystemSpareEvtBuffer[sizeof(TL_PacketHeader_t) + TL_EVT_HDR_SIZE + 255U];
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t BleSpareEvtBuffer[sizeof(TL_PacketHeader_t) + TL_EVT_HDR_SIZE + 255];

/* USER CODE BEGIN PV */
extern __IO uint32_t flag;
__IO uint8_t  timestamp_flag;
uint8_t PVD_timer_Id;

/* USER CODE END PV */

/* Private functions prototypes-----------------------------------------------*/
static void SystemPower_Config( void );
static void appe_Tl_Init( void );
static void APPE_SysStatusNot( SHCI_TL_CmdStatus_t status );
static void APPE_SysUserEvtRx( void * pPayload );
static void Switch_OFF_PVD_GPIO( void );
/* USER CODE BEGIN PFP */
static void Led_Init( void );
static void Button_Init( void );
void Check_PVD_Val( void );
/* USER CODE END PFP */

/* Functions Definition ------------------------------------------------------*/
void APPE_Init( void )
{
	SystemPower_Config(); /**< Configure the system Power Mode */

	HW_TS_Init(hw_ts_InitMode_Full, &hrtc); /**< Initialize the TimerServer */

	/* USER CODE BEGIN APPE_Init_1 */
	APPD_Init();

	/**
	 * The Standby mode should not be entered before the initialization is over
	 * The default state of the Low Power Manager is to allow the Standby Mode so an request is needed here
	 */
	UTIL_LPM_SetOffMode(1 << CFG_LPM_APP, UTIL_LPM_DISABLE);

	Led_Init();

	Button_Init();
	/* USER CODE END APPE_Init_1 */
	appe_Tl_Init();	/* Initialize all transport layers */

	/**
	 * From now, the application is waiting for the ready event ( VS_HCI_C2_Ready )
	 * received on the system channel before starting the Stack
	 * This system event is received with APPE_SysUserEvtRx()
	 */
	/* USER CODE BEGIN APPE_Init_2 */
	//timer for PVD
	HW_TS_Create(CFG_TIM_PROC_ID_ISR, &(PVD_timer_Id), hw_ts_SingleShot, Switch_OFF_PVD_GPIO);
	/* USER CODE END APPE_Init_2 */
	return;
}
/* USER CODE BEGIN FD */

/* USER CODE END FD */

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/

/**
 * @brief  Configure the system for power optimization
 *
 * @note  This API configures the system to be ready for low power mode
 *
 * @param  None
 * @retval None
 */
static void SystemPower_Config(void)
{
	/**
	 * Select HSI as system clock source after Wake Up from Stop mode
	 */
	LL_RCC_SetClkAfterWakeFromStop(LL_RCC_STOP_WAKEUPCLOCK_HSI);

	/* Initialize low power manager */
	UTIL_LPM_Init();
	/* Initialize the CPU2 reset value before starting CPU2 with C2BOOT */
	LL_C2_PWR_SetPowerMode(LL_PWR_MODE_SHUTDOWN);

#if (CFG_USB_INTERFACE_ENABLE != 0)
	/**
	 *  Enable USB power
	 */
	HAL_PWREx_EnableVddUSB();
#endif

	return;
}

static void appe_Tl_Init( void )
{
  TL_MM_Config_t tl_mm_config;
  SHCI_TL_HciInitConf_t SHci_Tl_Init_Conf;
  /**< Reference table initialization */
  TL_Init();

  /**< System channel initialization */
  UTIL_SEQ_RegTask( 1<< CFG_TASK_SYSTEM_HCI_ASYNCH_EVT_ID, UTIL_SEQ_RFU, shci_user_evt_proc );
  SHci_Tl_Init_Conf.p_cmdbuffer = (uint8_t*)&SystemCmdBuffer;
  SHci_Tl_Init_Conf.StatusNotCallBack = APPE_SysStatusNot;
  shci_init(APPE_SysUserEvtRx, (void*) &SHci_Tl_Init_Conf);

  /**< Memory Manager channel initialization */
  tl_mm_config.p_BleSpareEvtBuffer = BleSpareEvtBuffer;
  tl_mm_config.p_SystemSpareEvtBuffer = SystemSpareEvtBuffer;
  tl_mm_config.p_AsynchEvtPool = EvtPool;
  tl_mm_config.AsynchEvtPoolSize = POOL_SIZE;
  TL_MM_Init( &tl_mm_config );

  TL_Enable();

  return;
}

static void APPE_SysStatusNot( SHCI_TL_CmdStatus_t status )
{
  UNUSED(status);
  return;
}

/**
 * The type of the payload for a system user event is tSHCI_UserEvtRxParam
 * When the system event is both :
 *    - a ready event (subevtcode = SHCI_SUB_EVT_CODE_READY)
 *    - reported by the FUS (sysevt_ready_rsp == FUS_FW_RUNNING)
 * The buffer shall not be released
 * ( eg ((tSHCI_UserEvtRxParam*)pPayload)->status shall be set to SHCI_TL_UserEventFlow_Disable )
 * When the status is not filled, the buffer is released by default
 */
static void APPE_SysUserEvtRx( void * pPayload )
{
  UNUSED(pPayload);
  /* Traces channel initialization */
  APPD_EnableCPU2( );

  APP_BLE_Init( );
  UTIL_LPM_SetOffMode(1U << CFG_LPM_APP, UTIL_LPM_ENABLE);
  return;
}

/* USER CODE BEGIN FD_LOCAL_FUNCTIONS */
static void Led_Init( void )
{
#if (CFG_LED_SUPPORTED == 1)
  /**
   * Leds Initialization
   */

//  BSP_LED_Init(LED_BLUE);			//NUCLEO
//  BSP_LED_Init(LED_GREEN);		//NUCLEO
//  BSP_LED_Init(LED_RED);			//NUCLEO
  BSP_LED_Init(LED_GREEN_BR);		//SHIELD
  BSP_LED_Init(LED_YELLOW_BR);		//SHIELD
  BSP_LED_Init(LED_RED_BR);			//SHIELD

//  BSP_LED_On(LED_GREEN);
#endif

  return;
}

static void Button_Init( void )
{
#if (CFG_BUTTON_SUPPORTED == 1)
	/**
	 * Button Initialization
	 */

	//USE for NUCLEO buttons
	BSP_PB_Init(BUTTON_SW1, BUTTON_MODE_EXTI);
	BSP_PB_Init(BUTTON_SW2, BUTTON_MODE_EXTI);
	//USE for SHIELD buttons
	//BSP_PB_Init(BUTTON_SW1_BR, BUTTON_MODE_EXTI);
	//BSP_PB_Init(BUTTON_SW2_BR, BUTTON_MODE_EXTI);
#endif

	return;
}

static void Switch_OFF_PVD_GPIO(){
/* USER CODE BEGIN Switch_OFF_PVD_GPIO */
  BSP_LED_Off(LED_GREEN_BR);
  BSP_LED_Off(LED_YELLOW_BR);
  BSP_LED_Off(LED_RED_BR);
/* USER CODE END Switch_OFF_PVD_GPIO */
}
/* USER CODE END FD_LOCAL_FUNCTIONS */

/*************************************************************
 *
 * WRAP FUNCTIONS
 *
 *************************************************************/

void UTIL_SEQ_Idle( void )
{
#if ( CFG_LPM_SUPPORTED == 1)
  UTIL_LPM_EnterLowPower( );
#endif
  return;
}

/**
  * @brief  This function is called by the scheduler each time an event
  *         is pending.
  *
  * @param  evt_waited_bm : Event pending.
  * @retval None
  */
void UTIL_SEQ_EvtIdle( UTIL_SEQ_bm_t task_id_bm, UTIL_SEQ_bm_t evt_waited_bm )
{
  UTIL_SEQ_Run( UTIL_SEQ_DEFAULT );
}

void shci_notify_asynch_evt(void* pdata)
{
  UTIL_SEQ_SetTask( 1<<CFG_TASK_SYSTEM_HCI_ASYNCH_EVT_ID, CFG_SCH_PRIO_0);
  return;
}

void shci_cmd_resp_release(uint32_t flag)
{
  UTIL_SEQ_SetEvt( 1<< CFG_IDLEEVT_SYSTEM_HCI_CMD_EVT_RSP_ID );
  return;
}

void shci_cmd_resp_wait(uint32_t timeout)
{
  UTIL_SEQ_WaitEvt( 1<< CFG_IDLEEVT_SYSTEM_HCI_CMD_EVT_RSP_ID );
  return;
}

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */
void HAL_GPIO_EXTI_Callback( uint16_t GPIO_Pin )
{
	switch (GPIO_Pin)
	{
	case BUTTON_SW1_PIN:				//use BUTTON_SW1_PIN for nucleo SW1, use BUTTON_SW1_BR_PIN for Breathe Shield SW1
		APP_BLE_Key_Button1_Action();
		Check_PVD_Val();
		timestamp_flag = 1;
		break;

	case BUTTON_SW2_PIN:				//use BUTTON_SW2_PIN for nucleo SW2, use BUTTON_SW2_BR_PIN for Breathe Shield SW2
		APP_BLE_Key_Button2_Action();
		timestamp_flag = 0;
		break;

	default:
		break;

	}
	return;
}

/**
  * @brief  This function is called when SW1_BR is pressed. It checks the PVD flag and toggles the corresponding LED
  *
  * @param  None
  * @retval None
  */
void Check_PVD_Val( void )
{
	if (flag == 2) {
		BSP_LED_Toggle(LED_GREEN_BR);
	} else if (flag == 1) {
		BSP_LED_Toggle(LED_YELLOW_BR);
	} else if (flag == 0) {
		BSP_LED_Toggle(LED_RED_BR);
	}
	HW_TS_Start(PVD_timer_Id, (uint32_t)LED_ON_PVD);

}


/* USER CODE END FD_WRAP_FUNCTIONS */
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
